JS-CS-Detection-byExample/Dataset (ALERT 5 GB)/374130/spot-1.2.5/spot-1.2.5/doc/userdoc/ioltl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Common input and output options for LTL/PSL formulas</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Common input and output options for LTL/PSL formulas"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-08-21T17:43+0200"/>
<meta name="author" content="Alexandre Duret-Lutz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="http://spot.lip6.fr/css/spot-zenburn.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:center;white-space:nowrap;">
 <a accesskey="h" href="tools.html">UP</a> | <a accesskey="H" href="tools.html">HOME</a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Common input and output options for LTL/PSL formulas</h1>

<p>Spot supports different syntaxes for LTL/PSL formulas.  This pages
document the options, common to all tools where it makes sense, that
are used to specify input and output of formula.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Common input options</a>
<ul>
<li><a href="#sec-1-1">Default parser</a></li>
<li><a href="#sec-1-2">Lenient mode</a></li>
<li><a href="#sec-1-3">Prefix parser</a></li>
</ul>
</li>
<li><a href="#sec-2">Common output options</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Common input options</h2>
<div class="outline-text-2" id="text-1">


<p>
All tools that read LTL/PSL formulas implement the following options:
</p>

<pre class="example">
  -f, --formula=STRING       process the formula STRING
  -F, --file=FILENAME[/COL]  process each line of FILENAME as a formula; if COL
                             is a positive integer, assume a CSV file and read
                             column COL; use a negative COL to drop the first
                             line of the CSV file
      --lbt-input            read all formulas using LBT's prefix syntax
      --lenient              parenthesized blocks that cannot be parsed as
                             subformulas are considered as atomic properties
</pre>


<p>
<code>-f</code> is used to pass one formula on the command line, but this option can
be repeated to pass multiple formulas.
</p>
<p>
<code>-F</code> is used to read formulas from a file (one formula per line).
This option can also be repeated to pass multiple files.  If the
filename specified is <code>-</code> (as in <code>-F-</code>), then formulas are read from
standard input.  If a filename is suffixed with <code>/COL</code>, where <code>COL</code> is
a positive integer, then the file is assumed to be a CSV file, and
formulas are read from its <code>COL</code>-th column.  Use <code>/-COL</code> to read from
column <code>COL</code> and ignore the first line of the CSV file (which often
contains column headers).  We have <a href="csv.html">examples of reading or writing CSV files on a separate page</a>.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Default parser</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Spot's default LTL parser is able to parse the syntaxes of many tools,
such as <a href="http://spinroot.com">Spin</a>, <a href="http://vlsi.colorado.edu/~rbloem/wring.html">Wring</a>, <a href="http://goal.im.ntu.edu.tw">Goal</a>, etc.  For instance here are the preferred ways
to express the same formula for different tools.
</p>
<p>
<a name="tab-formula-syntaxes" id="tab-formula-syntaxes"></a>
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Tool</th><th scope="col" class="left">Formula</th></tr>
</thead>
<tbody>
<tr><td class="left">Spot</td><td class="left"><code>G(a -&gt; (b R !c))</code></td></tr>
<tr><td class="left">Spot (UTF-8)</td><td class="left"><code>□(a → (b R c̅))</code></td></tr>
<tr><td class="left">Spin</td><td class="left"><code>[](a -&gt; (b V !c))</code></td></tr>
<tr><td class="left">Wring</td><td class="left"><code>G(a=1 -&gt; (b=1 R c=0))</code></td></tr>
<tr><td class="left">Goal</td><td class="left"><code>G(a --&gt; (b R ~c))</code></td></tr>
</tbody>
</table>


<p>
Spot's default LTL parser will understand all of them.
</p>
<p>
For a complete definition of the supported operators, including PSL
operators, please refer to the <code>doc/tl/tl.pdf</code> document inside the
Spot distribution.
</p>
<p>
For Spot, an atomic proposition is any alphanumeric string that does
not start with the (upper case) characters <code>F</code>, <code>G</code>, or <code>X</code>.  For
instance <code>gfa</code> is an atomic proposition, but <code>GFa</code> actually denotes
the LTL formula <code>G(F(a))</code>.  Any double-quoted string is also
considered to be an atomic proposition, so if <code>GFa</code> had to be an
atomic proposition, it could be written
<code>"GFa"</code>
.
</p>
<p>
These double-quote string also make it possible to embed arbitrarily
complex expressions that represent an atomic proposition that Spot
should not try to interpret.  For instance:
</p><pre class="example">
"a &lt; b" U "process[2]@ok"
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Lenient mode</h3>
<div class="outline-text-3" id="text-1-2">


<p>
In version 6, Spin extended its syntax to support arbitrary atomic expression
in LTL formulas. The previous formula would be written simply:
</p><pre class="example">
(a &lt; b) U (process[2]@ok)
</pre>


<p>
While Spot cannot read the above syntax by default, it can do it if
you specify the <code>--lenient</code> option.  (This global option affects all
formulas that are input.)
</p>
<p>
The same parser is used, however its processing of parenthesis blocks
is different: every time a parenthesis block is scanned, the parser
first tries to recursively parse the block as an LTL/PSL formula, and
if this parsing failed, the block is considered to be an atomic
proposition.
</p>

<p>
For instance <code>(a U b) U c</code> will be successfully converted into an LTL
formula with two operators, while parsing <code>(a + b &lt; 2) U c</code> will
consider <code>a + b &lt; 2</code> as an atomic proposition.
</p>
<p>
An unfortunate side-effect of <code>--lenient</code> parsing is that many syntax
errors will not be caught.  Compare the following syntax error:
</p>



<pre class="src src-sh">ltlfilt -f <span class="org-string">'(a U b U) U c'</span>
</pre>


<pre class="example">
&gt;&gt;&gt; (a U b U) U c
            ^
syntax error, unexpected closing parenthesis
&gt;&gt;&gt; (a U b U) U c
           ^
missing right operand for "until operator"
</pre>


<p>
With the same command in <code>--lenient</code> mode:
</p>



<pre class="src src-sh">ltlfilt --lenient -f <span class="org-string">'(a U b U) U c'</span>
</pre>

<pre class="example">
"a U b U" U c
</pre>


<p>
Here <code>a U b U</code> was taken as an atomic proposition.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Prefix parser</h3>
<div class="outline-text-3" id="text-1-3">


<p>
The prefix syntax used by tools such as <a href="http://www.tcs.hut.fi/Software/maria/tools/lbt/">LBT</a>, <a href="http://www.tcs.hut.fi/Software/lbtt/">LBTT</a>, <a href="http://tcs.legacy.ics.tkk.fi/users/tlatvala/scheck/">scheck</a> or <a href="http://www.ltl2dstar.de">ltl2dstar</a>
requires a different parser.  For these tools, the above example
formula has to be written <code>G i p0 V p1 ! p2</code> (in LBT's syntax, atomic
propositions must start with <code>p</code> and be followed by a number).  Spot's
<code>--lbt-input</code> option can be used to activate the parser for this
syntax.
</p>
<p>
As an extension to LBT's syntax, alphanumeric atomic propositions that
follow the "<code>p</code> + number" rule will be accepted if they do not
conflict with one of the operator (e.g., <code>i</code>, the implies operator,
cannot be used as an atomic proposition).  Also any atomic proposition
may be double-quoted.  These extensions are compatible with the syntax
used by <a href="http://www.ltl2dstar.de">ltl2dstar</a>.
</p>
<p>
<code>--lbt-input</code> is a global option that affects <b>all</b> formulas that are read.
</p>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Common output options</h2>
<div class="outline-text-2" id="text-2">


<p>
All tools that output LTL/PSL formulas implement the following options:
</p>




<pre class="example">-8, --utf8                 output using UTF-8 characters
    --csv-escape           quote the formula for use in a CSV file
    --format=FORMAT        specify how each line should be output (default:
                           "%f")
-l, --lbt                  output in LBT's syntax
    --latex                output using LaTeX macros
-p, --full-parentheses     output fully-parenthesized formulas
-s, --spin                 output in Spin's syntax
    --spot                 output in Spot's syntax (default)
    --wring                output in Wring's syntax
</pre>



<p>
The <code>--spot</code>, <code>--utf-8</code>, <code>--spin</code>, <code>--wring</code> options select different
output syntaxes as seen in <a href="#tab-formula-syntaxes">the above table</a>.
</p>
<p>
Option <code>--latex</code> causes formulas to be output using LaTeX macros for
each operator.  You may define these macros as you wish, and some
example definitions are in <code>doc/tl/spotltl.sty</code>.
</p>
<p>
The <code>-p</code> option can be used to request that parentheses be used at all
levels.
</p>
<p>
Note that by default Spot always outputs parentheses around operators
such as <code>U</code>, because not all tools agree on their associativity.  For
instance <code>a U b U c</code> is read by Spot as <code>a U (b U c)</code> (because <code>U</code> is
right-associative in the PSL standard), while Spin (among other tools)
with read it as <code>(a U b) U c</code>.
</p>
<p>
The <code>--lbt</code> option requests an output in LBT's prefix format, and in
that case discussing associativity and parentheses makes no sense.
</p>
<p>
The <code>--csv</code> causes the formulas to be double-quoted (with inner
double-quotes doubled, as per RFC 4180), regardless of the selected
format.  This is needed if the formula should appear in a CSV file,
and you want to be robust to formulas that contains commas or
double-quotes.  We have <a href="csv.html">examples of reading or writing CSV files on a separate page</a>.
</p>
<p>
The <code>--format</code> option can be used to fine-tune the way the formula is
output.  Not using the <code>--format</code> option is equivalent to using
<code>--format=%f</code>.  The semantic of the available <code>%</code>-sequences differ
from tool to tool:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left"><code>%f</code></th><th scope="col" class="left"><code>%F</code></th><th scope="col" class="left"><code>%L</code></th><th scope="col" class="left"><code>%&lt;</code></th><th scope="col" class="left"><code>%&gt;</code></th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="ltlfilt.html"><code>ltlfilt</code></a></td><td class="left">output formula</td><td class="left">input filename</td><td class="left">input line</td><td class="left">leading text</td><td class="left">trailing text</td></tr>
<tr><td class="left"><a href="genltl.html"><code>genltl</code></a></td><td class="left">output formula</td><td class="left">pattern name</td><td class="left">pattern parameter</td><td class="left">(empty)</td><td class="left">(empty)</td></tr>
<tr><td class="left"><a href="randltl.html"><code>randltl</code></a></td><td class="left">output formula</td><td class="left">(empty)</td><td class="left">formula number</td><td class="left">(empty)</td><td class="left">(empty)</td></tr>
</tbody>
</table>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-08-21T17:43+0200</p>
<p class="author">Author: Alexandre Duret-Lutz</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
